Repository: bjeavons/zxcvbn-php
Catalog: src/Locales/*.UTF8/LC_MESSAGES/ZxcvbnPhp.po
Languages: fr_fr

source: Capitalization doesn't help very much
fr_fr: Les majuscules n'aide pas vraiement

source: All-uppercase is almost as easy to guess as all-lowercase
fr_fr: Mettre tout en majuscule ne rend pas le mot de passe plus compliqué à deviner que s'il était tout en minuscule

source: This is a top-10 common password
fr_fr: Ce mot de passe fait parti du top 10 des plus communs

source: This is a top-100 common password
fr_fr: Ce mot de passe fait parti du top 100 des plus communs

source: This is a very common password
fr_fr: Ce mot de passe est très communs

source: This is similar to a commonly used password
fr_fr: Ce mot de passe est similaire à un des plus communs

source: A word by itself is easy to guess
fr_fr: Un mot en lui-même est assez simple à deviner

source: Names and surnames by themselves are easy to guess
fr_fr: Les noms et surnoms en eux-même sont assez simples à deviner

source: Common names and surnames are easy to guess
fr_fr: Les noms et surnoms communs sont assez simples à deviner

source: Reversed words aren't much harder to guess
fr_fr: Les mots réservés ne sont pas plus compliqués à deviner

source: Dates are often easy to guess
fr_fr: Les dates sont souvent faciles à deviner

source: Avoid dates and years that are associated with you
fr_fr: Éviter les dates et les années qui vous sont associées

source: Recent years are easy to guess
fr_fr: Les années récentes sont simples à deviner

source: Avoid recent years
fr_fr: Éviter les années récentes

source: Avoid years that are associated with you
fr_fr: Éviter les années qui vous sont associées

source: Straight rows of keys are easy to guess
fr_fr: Les rangées de touches sont faciles à deviner

source: Short keyboard patterns are easy to guess
fr_fr: Les sequences courtes de touches d'un clavier sont simples à deviner

source: Use a longer keyboard pattern with more turns
fr_fr: Utilisez une séquence de touches d'un clavier plus longue et avec plus de répétitions

source: Predictable substitutions like '@' instead of 'a' don't help very much
fr_fr: Les substitutions comme un '@' à la place d'un 'a' n'aide pas vraiment

source: Repeats like "aaa" are easy to guess
fr_fr: Les répétitions comme "aaa" sont simples à deviner

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc"
fr_fr: Les répétitions comme "abcabcabc" ne sont que légèrement plus compliquées à deviner que "abc"

source: Avoid repeated words and characters
fr_fr: Éviter les répétitions de mots ou de caractères

source: Sequences like abc or 6543 are easy to guess
fr_fr: Les séquences comme abc ou 6543 sont simples à deviner

source: Avoid sequences
fr_fr: Éviter les séquences

source: Use a few words, avoid common phrases
fr_fr: Utiliser quelques mots, éviter les phrases courantes

source: No need for symbols, digits, or uppercase letters
fr_fr: Pas besoin de symboles, de chiffres ou de lettres majuscules

source: Add another word or two. Uncommon words are better.
fr_fr: Ajouter un ou deux autres mots. Les mots peu commun sont préférables.

source: less than a second
fr_fr: moins d'une seconde

source: %d second
fr_fr: %d seconde

source: %d hour
fr_fr: %d heure

source: %d day
fr_fr: %d jour

source: %d month
fr_fr: %d mois

source: %d year
fr_fr: %d année

source: centuries
fr_fr: siècles
